/*==============================================================================
	z2s.h: S -> Reverse Bilinear transfer
		Refer to http://web.boss.rosenet/~ikeda/techdoc/bilinear.pdf
		$Header: /home/boss/ikeda/source/RCS/z2s.h,v 1.1 2004/12/22 00:51:25 ikeda Exp ikeda $
==============================================================================*/
#ifndef	__Z2S_H
#define	__Z2S_H

/*------------------------------------------------------------------------------
	parameter	a: z平面伝達関数分子係数配列		a0+a1s+a2s...+aNs 
				b: z平面伝達関数分母係数配列		b0+b1s+b2s...+bNs 
				c: s平面伝達関数分子係数格納配列	c0+c1z^-1+c2z^-2....+cNz^-N
				d: s平面伝達関数分子係数格納配列	d0+d1z^-1+d2z^-2....+dNz^-N
				N: 次数		(0...N) 
				T: サンプリング周期  1/Fs	
------------------------------------------------------------------------------*/
extern void z2s(const double* a, const double* b, double* c, double* d, int N, double T);

#endif	/* __Z2S_H */
/*==============================================================================
	$Log: z2s.h,v $
	Revision 1.1  2004/12/22 00:51:25  ikeda
	Initial revision

==============================================================================*/	
